### 5.2.4 산술연산과 데이터 정렬

In [152]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd

In [22]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [23]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [24]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [25]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [26]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

#### 서로 겹치는 색인이 없다면 데이터는 NA 값이 된다.

- 산술연산 시 누락된 값은 전파
- DataFrame에서는 로우와 칼럼 모두에 적용

### DataFrame과 Series의 차이점은??

In [27]:
list('bcd')

['b', 'c', 'd']

In [28]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])

In [29]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [30]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [31]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [32]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 산술연산 메서드에 채워 넣을 값 지정하기

In [33]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [34]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [35]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [36]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [37]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [38]:
#e칼럼의 값을 살펴보자 fill_value=0인데 왜 4,9,14,19가 채워지는지 알아보자.
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [39]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [40]:
# 원래의 df2값에 1을 더하여 나타내준다.
df1.add(df2, fill_value=1)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0  11.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0

In [41]:
df1.add(df2, fill_value=2)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   6.0
1   9.0  11.0  13.0  15.0  11.0
2  18.0  20.0  22.0  24.0  16.0
3  17.0  18.0  19.0  20.0  21.0

In [42]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### 산술연산 메서드

메서드 | 설명
--- | ---
add | 덧셈(+)을 위한 메서드
sub | 뺄셈(-)을 위한 메서드
div | 나눗셈(/)을 위한 메서드
mul | 곱셈(*)을 위한 메서드

#### DataFrame과 Series 간의 연산

In [43]:
arr = np.arange(12.).reshape((3, 4))

In [44]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [45]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [46]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [47]:
arr - arr[1]

array([[-4., -4., -4., -4.],
       [ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.]])

#### 브로드캐스팅

In [48]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [49]:
series = frame.ix[0]

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

In [50]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [51]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [52]:
#value값이 0이 된것을 확인 할 수 있다.
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

#### 기본적으로 DataFrame 과 Series 간의 산술연산은 Series의 색인을 DataFrame의 칼럼에 맞추고 아래 로우로 전파

#### 만약 색인 값을 DataFrame의 칼럼이나 Series의 색인에서 찾을 수 없다면 그 객체는 형식을 맞추기 위해 재색인한다.

In [53]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [54]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [55]:
series2, type(series2)

(b    0
 e    1
 f    2
 dtype: int64, pandas.core.series.Series)

In [56]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

- 각 로우에 대해 연산을 수행하고 싶다면 산술연산 메서드 사용

In [57]:
series3 = frame['d']

In [58]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [59]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [60]:
# 인자로 넘기는 axis 값은 연산을 적용할 축 번호
# axis=0은 DataFrame의 로우를 따라 연산을 수행
# .sub는 뺄셈을 해주는 메서드
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 5.2.5 함수 적용과 매핑

- pandas 객체에도 NumPy의 유니버셜 함수(배열의 각 원소에 적용되는 메서드)를 적용 가능

In [61]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [62]:
frame

               b         d         e
Utah   -0.338069  2.233112 -0.702744
Ohio    0.346818 -0.265056 -0.789238
Texas   1.110307 -0.538926 -0.919917
Oregon  1.391427  3.143076  0.285156

In [63]:
np.abs(frame)

               b         d         e
Utah    0.338069  2.233112  0.702744
Ohio    0.346818  0.265056  0.789238
Texas   1.110307  0.538926  0.919917
Oregon  1.391427  3.143076  0.285156

In [64]:
frame

               b         d         e
Utah   -0.338069  2.233112 -0.702744
Ohio    0.346818 -0.265056 -0.789238
Texas   1.110307 -0.538926 -0.919917
Oregon  1.391427  3.143076  0.285156

- 자주 사용되는 또 다른 연산은 각 로우나 칼럼의 1차원 배열에 함수를 적용하는 것
- DataFrame의 apply 메서드를 통해 수행

In [65]:
# 최대값-최소값
f = lambda x: x.max() - x.min()

In [66]:
# apply함수의 정보를 알려준다.
frame.apply?

In [67]:
# 1. b 컬럼 기준으로 row 값들을 대상으로
# 2. max값과 min값을 구한다.
# 3. max - min을 한 후 결과값 돌려준다.
# 1.107814 - (-0.026992) = 1.134806
frame.apply(f)

b    1.729496
d    3.682002
e    1.205073
dtype: float64

In [68]:
# 0.328717 - 0.121724 = 0.206992
frame.apply(f, axis=1)

Utah      2.935856
Ohio      1.136056
Texas     2.030224
Oregon    2.857920
dtype: float64

In [69]:
frame

               b         d         e
Utah   -0.338069  2.233112 -0.702744
Ohio    0.346818 -0.265056 -0.789238
Texas   1.110307 -0.538926 -0.919917
Oregon  1.391427  3.143076  0.285156

### axis의 로우, 컬럼 구분

#### 로우 
- frame.sub(series3, **axis=0**) 
- frame.apply(f, **aixs=1**)
- df.sum(**axis=1**)

#### 컬럼
- frame.sort_index(**axis=1**)


#### DataFrame에서 axis=

- 0: row
- 1: column

- 배열의 합계나 평균같은 일반적인 통계는 DataFrame의 메서드로 있으므로 apply 메서드를 사용해야만 하는 것은 아니다.
- apply 메서드에 전달된 함수는 스칼라 값을 반환할 필요 없으며, Series 또는 여러 값을 반환해도 된다.

In [70]:
#함수의 이름은 f 
# x를 입력받아 함수문 안의 문장을 실행한다.
def f(x):
    # 시리즈를 반환한다.
    return Series([x.min(), x.max()], index=['min', 'max'])

In [71]:
frame.apply(f)

            b         d         e
min -0.338069 -0.538926 -0.919917
max  1.391427  3.143076  0.285156

In [72]:
type(frame.apply(f))

pandas.core.frame.DataFrame

In [73]:
# 짧은 함수.
# %는 모듈러연산.(나머지 연산)
format = lambda x: '%.2f' % x

In [74]:
frame.applymap(format)

            b      d      e
Utah    -0.34   2.23  -0.70
Ohio     0.35  -0.27  -0.79
Texas    1.11  -0.54  -0.92
Oregon   1.39   3.14   0.29

In [75]:
frame['e'].map(format)

Utah      -0.70
Ohio      -0.79
Texas     -0.92
Oregon     0.29
Name: e, dtype: object

In [76]:
# 원래 dtype이 object 값인데 위에서 float 형식으로 변경했기 때문에 dtype이 'float64'가 됐다.
frame['e']

Utah     -0.702744
Ohio     -0.789238
Texas    -0.919917
Oregon    0.285156
Name: e, dtype: float64

### 5.2.6 정렬과 순위

In [77]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [78]:
# index를 정렬한다.
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [79]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [80]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [81]:
# 인덱스정렬(로우기준)
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [82]:
# 칼럼을 기준으로 정렬.
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

#### index, column 모두 만족시키는 정렬은 어떻게 해야돼지???

In [83]:
frame.sort_index(axis=0, ascending=True)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [84]:
obj = Series([4, 7, -3, 2])

In [85]:
# 값에 따라 정렬
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [86]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [87]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

#### 정렬시 NaN은 가장 마지막에 위치
<pre>
4    -3
5     2
0     4
2     7
1   NaN
3   NaN
</pre>

In [88]:
frame = DataFrame({'b': [4, 7, -3, 2],
                   'a': [0, 1, 0, 1]})

In [89]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [90]:
# 'b'칼럼의 값을 기준으로 인덱스를 정렬한다.
frame.sort_index(by='b')

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  from ipykernel import kernelapp as app

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [91]:
frame.sort_index(by=['a', 'b'])

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

### 뭘 기준으로 rank 하는지 도저히 모르겠다..!! -> 스터디 후 알게 됨

In [92]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [93]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [94]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

#### Rank 해석

1. -5가 1.0
2. 0이 2.0
3. 2가 3.0
4. 4가 4.5, 왜냐하면 동률이기 때문에 4.0이 안되고 4.0과 5.0의 중간인 4.5가 됨
5. 7도 중복이기 때문에 6.0과 7.0 중간인 6.5가 됨

In [95]:
# 데이터 상에서 나타나는 순서에 따라 순위
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [96]:
# 내림차순으로 순위
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [97]:
frame = DataFrame({'b': [4.3, 7, -3, 2],
                   'a':[0, 1, 0, 1],
                   'c':[-2, 5, 8, -2.5]})

In [98]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [99]:
# 0, 4.3, -2.0 에서 rank 정함
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [100]:
# 0, 1, 0, 1 에서 rank 정함
frame.rank()

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

#### 순위의 동률을 처리하는 메서드

메서드 | 설명
--- | ---
'average' | 기본 값: 같은 값을 가지는 항목의 평균 값을 순위로 삼는다.
'min' | 같은 값을 가지는 그룹을 낮은 순위로 매긴다.
'max' | 같은 값을 가지는 그룹을 높은 순위로 매긴다.
'first' | 데이터 내에서 위치에 따라 순위를 매긴다.

### 5.2.7 중복 색인

In [101]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [102]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [103]:
# obj의 index값이 유니크한지 점검.
obj.index.is_unique

False

- 중복되는 색인 값이 있으면 색인을 이용한 데이터 선택은 다르게 동작하고 하나의 Series 객체 반환
- 중복되는 색인 값이 없으면 색인을 이용한 데이터 선택은 스칼라 값을 반환

In [104]:
obj['a']

a    0
a    1
dtype: int64

In [105]:
# 하나의 Series 객체 반환 한다
type(obj['a'])

pandas.core.series.Series

In [106]:
obj['c']

4

In [107]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [108]:
df

          0         1         2
a  0.552635  1.603553 -2.202025
a  0.841960 -0.996147 -0.596548
b  0.123214  0.274903  0.024639
b -0.364114 -0.212358  0.304956

In [109]:
df.ix['b']

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  if __name__ == '__main__':

          0         1         2
b  0.123214  0.274903  0.024639
b -0.364114 -0.212358  0.304956

<img src='files/images/panda2.jpg' width='300px' />

## 5.3 기술통계 계산과 요약

- pandas 객체는 일반적인 수학 메서드와 통계 메서드 존재
- 이 메서드는 대부분 Series나 DataFrame 하나의 칼럼이나 로우에서 단일 값(합이나 평균 같은)을 구하는 축소 혹은 요약통계 범주에 속함
- 처음부터 누락된 데이터를 제외하도록 설계

In [110]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [111]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [112]:
# NaN은 계산 안됨
df.sum()

one    9.25
two   -5.80
dtype: float64

In [113]:
# 각 로우의 합 반환
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [114]:
# 평균을 구해주는데 NaN값을 스킵하지 않는다.
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

#### 축소 메서드 옵션

옵션 | 설명
--- | ---
axis | 연산을 수행할 축. DataFrame에서 0은 로우고 1은 칼럼이다.
skipna | 누락된 값을 제외할 것인지 정하는 옵션. 기본값은 True다.
level | 계산하려는 축이 계층적 색인(다중 색인)이라면 레벨에 따라 묶어서 계산한다.

In [115]:
# NA/null values는 제외된다.
df.idxmax?

In [116]:
df.idxmax()

one    b
two    d
dtype: object

In [117]:
# cumulative. 아래로 갈수록 누산 됨
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [118]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [119]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [120]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [121]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [122]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [123]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

#### 기술통계와 요약통계

메서드 | 설명
--- | ---
count | NA 값을 제외한 값의 수를 반환한다.
describe | Series나 DataFrame의 각 칼럼에 대한 요약통계를 계산한다.
min, max | 최소, 최대값을 계산한다.
argmin, argmax | 각각 최소, 최대값을 갖고 있는 색인의 위치(정수)를 반환한다.
idxmin, idxmax | 각각 최소, 최대 값을 갖고 있는 색인의 값을 반환한다.
quantile | 0부터 1까지의 분위수를 계산한다.
sum | 합을 계산한다.
mean | 평균을 계산한다.
median | 중간 값(50% 분위)을 반환한다.
mad | 평균 값에서 절대 평균편차를 구한다.
var | 표본 분산의 값을 구한다.
std | 표본 정규 분산의 값을 구한다.
skew | 표본 비대칭도(3차 적률)의 값을 구한다.
cumsum | 누적 합을 구한다.
cummin, cummax | 각각 누적 최소 값과 누적 최대 값을 계산한다.
cumprod | 누적 곱을 구한다.
diff | 1차 산술 차를 구한다(시게열 데이터 처리시 유용하다).
pct_change | 퍼센트 변화율을 계산한다.

### 5.3.1 상관관계와 공분산

In [124]:
from pandas_datareader import data as web

all_data = {}

# GOOG -> GOOGL
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOGL']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [125]:
# 각 주식의 퍼센트 변화율을 계산.
returns = price.pct_change()

In [126]:
# 데이터의 끝부분만 확인해본다.
returns.tail()

                AAPL     GOOGL       IBM      MSFT
Date
2017-08-28  0.010071 -0.002547 -0.008557  0.000137
2017-08-29  0.008918  0.008210  0.004421  0.003021
2017-08-30  0.002701  0.008421 -0.004052  0.013142
2017-08-31  0.003979  0.012304  0.003297  0.010269
2017-09-01  0.000305 -0.003402  0.007341 -0.011101

In [127]:
# price데이터 정보.
price

                  AAPL       GOOGL         IBM       MSFT
Date
2010-01-04   27.505054  313.688690  109.173752  25.275177
2010-01-05   27.552608  312.307312  107.854950  25.283342
2010-01-06   27.114347  304.434448  107.154320  25.128178
2010-01-07   27.064222  297.347351  106.783417  24.866852
2010-01-08   27.244156  301.311310  107.854950  25.038349
2010-01-11   27.003820  300.855865  106.725700  24.719858
2010-01-12   26.696650  295.535522  107.574692  24.556530
2010-01-13   27.073221  293.838837  107.343887  24.785191
2010-01-14   26.916422  295.220215  109.058350  25.283342
2010-01-15   26.466595  290.290283  108.621490  25.201679
2010-01-19   27.637430  294.104095  110.566757  25.397671
2010-01-20   27.212029  290.495483  107.360382  24.981182
2010-01-21   26.741631  291.781769  106.330040  24.507528
2010-01-22   25.415281  275.280273  103.445122  23.650047
2010-01-25   26.099028  270.270264  103.956169  23.944042
2010-01-26   26.467880  271.481476  103.651207  24.091042
2010-01-27   26.717218  271.321320  104.129272  24.229874
2010-01-28   25.613209  267.412415  102.002670  23.813379
2010-01-29   24.683992  265.235229  100.881660  23.013071
2010-02-01   25.027143  266.776764  102.760971  23.200891
2010-02-02   25.172379  265.825836  103.469849  23.241730
2010-02-03   25.605494  270.680695  103.577019  23.380560
2010-02-04   24.682707  263.653656  101.384453  22.735409
2010-02-05   25.120964  265.910919  101.813095  22.882408
2010-02-08   24.948748  267.002014  100.910622  22.637409
2010-02-09   25.214790  268.488495  102.011803  22.874241
2010-02-10   25.077271  267.492493  101.680611  22.857906
2010-02-11   25.533520  268.468475  102.442314  22.964071
2010-02-12   25.753294  266.826813  102.665886  22.808908
2010-02-16   26.141434  270.920929  103.684265  23.260166
...                ...         ...         ...        ...
2017-07-24  151.495071  998.309998  144.463654  73.209946
2017-07-25  152.142548  969.030029  144.661560  73.796822
2017-07-26  152.859726  965.309998  143.840240  73.657562
2017-07-27  149.971069  952.510010  143.553284  72.772285
2017-07-28  148.915207  958.330017  142.781418  72.652916
2017-07-31  148.148224  945.500000  143.157455  72.314713
2017-08-01  149.463058  946.559998  143.780869  72.195358
2017-08-02  156.525330  947.640015  142.939758  71.877052
2017-08-03  154.961472  940.299988  143.424637  71.767632
2017-08-04  155.778259  945.789978  143.642334  72.294823
2017-08-07  158.188797  945.750000  141.970001  72.016312
2017-08-08  159.453827  944.190002  142.110001  72.404243
2017-08-09  160.429993  940.080017  141.770004  72.085938
2017-08-10  155.320007  923.590027  141.839996  71.031555
2017-08-11  157.479996  930.090027  141.839996  72.115776
2017-08-14  159.850006  938.929993  142.320007  73.199997
2017-08-15  161.600006  938.080017  142.070007  73.220001
2017-08-16  160.949997  944.270020  142.500000  73.650002
2017-08-17  157.860001  927.659973  140.699997  72.400002
2017-08-18  157.500000  926.179993  139.699997  72.489998
2017-08-21  157.210007  920.869995  140.330002  72.150002
2017-08-22  159.779999  940.400024  141.009995  73.160004
2017-08-23  159.979996  942.580017  142.139999  72.720001
2017-08-24  159.270004  936.890015  142.940002  72.690002
2017-08-25  159.860001  930.500000  143.740005  72.820000
2017-08-28  161.470001  928.130005  142.509995  72.830002
2017-08-29  162.910004  935.750000  143.139999  73.050003
2017-08-30  163.350006  943.630005  142.559998  74.010002
2017-08-31  164.000000  955.239990  143.029999  74.769997
2017-09-01  164.050003  951.989990  144.080002  73.940002

[1931 rows x 4 columns]

In [128]:
# volume데이터 정보.
volume

                 AAPL     GOOGL       IBM       MSFT
Date
2010-01-04  123432400   3908400   6155300   38409100
2010-01-05  150476200   6003300   6841400   49749600
2010-01-06  138040000   7949400   5605300   58182400
2010-01-07  119282800  12815700   5840600   50559700
2010-01-08  111902700   9439100   4197200   51197400
2010-01-11  115557400  14411300   5730400   68754700
2010-01-12  148614900   9696800   8081500   65912100
2010-01-13  151473000  12980200   6455400   51863500
2010-01-14  108223500   8471700   7111800   63228100
2010-01-15  148516900  10858100   8494400   79913200
2010-01-19  182501900   8624700  13916200   46575700
2010-01-20  153038200   6494800  15197500   54849500
2010-01-21  152038600  12602700   9608600   73086700
2010-01-22  220441900  13587100  10088600  102004600
2010-01-25  266424900   8830900   5738500   63373000
2010-01-26  466777500   8702200   7135300   66639900
2010-01-27  430642100   7920800   8719200   63949500
2010-01-28  293375600   6451700   9622200  117513700
2010-01-29  311488100   8272700  11571200  193888500
2010-02-01  187469100   4497000   7242900   85931100
2010-02-02  174585600   8184200   5899900   54413700
2010-02-03  153832000   5992200   4177100   61397900
2010-02-04  189413000   6748600   9126900   77850000
2010-02-05  212576700   6305600   8617000   80960100
2010-02-08  119567700   5383200   5718500   52820600
2010-02-09  158221700   5633500   6044500   59195800
2010-02-10   92590400   5343600   5219100   48591300
2010-02-11  137586400   4815100   5089000   65993700
2010-02-12  163867200   4554800   8017700   81117200
2010-02-16  135934400   7301400   6777300   51935600
...               ...       ...       ...        ...
2017-07-24   21493200   3984500   3877600   21394800
2017-07-25   18853900   5933600   4208900   22018700
2017-07-26   15781000   2221600   3932400   16252200
2017-07-27   32476300   3717900   6430800   36844200
2017-07-28   17213700   1813800   3054800   18306700
2017-07-31   19845900   2283500   4355700   23600100
2017-08-01   35368600   1402600   3219500   22132300
2017-08-02   69936800   2039400   3540900   26499200
2017-08-03   27097300   1123900   3035400   18214400
2017-08-04   20559900   1254600   2549400   22579000
2017-08-07   21870300   1445800   4618300   18705700
2017-08-08   36205900   1505100   3298700   22044600
2017-08-09   26131500   1400900   2925800   22213400
2017-08-10   40804300   2707400   4525400   24734500
2017-08-11   26257100   1616700   3004000   21443700
2017-08-14   22028200   1150600   2222300   20067300
2017-08-15   29465500   1106500   4681500   19181400
2017-08-16   27671600   1345300   3287800   18150400
2017-08-17   27940600   1695700   4422100   22977500
2017-08-18   27428100   1337400   4152700   18761500
2017-08-21   26368500   1301200   3190700   17734800
2017-08-22   21604600   1775100   2544400   14343700
2017-08-23   19399100   1134500   4048300   13766500
2017-08-24   19818900   1294600   3592200   17098300
2017-08-25   25480100   1187300   2872900   12794300
2017-08-28   25966000   1049400   5134500   14569700
2017-08-29   29516900   1158600   3009500   11478400
2017-08-30   27269600   1120300   2736000   16897800
2017-08-31   26785100   1693300   3656400   27652800
2017-09-01   16552800   1040500   3348500   21706200

[1931 rows x 4 columns]

In [129]:
# 데이터의 윗부분 확인.
returns.head()

                AAPL     GOOGL       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003461 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [130]:
returns.MSFT

Date
2010-01-04         NaN
2010-01-05    0.000323
2010-01-06   -0.006137
2010-01-07   -0.010400
2010-01-08    0.006897
2010-01-11   -0.012720
2010-01-12   -0.006607
2010-01-13    0.009312
2010-01-14    0.020099
2010-01-15   -0.003230
2010-01-19    0.007777
2010-01-20   -0.016399
2010-01-21   -0.018960
2010-01-22   -0.034988
2010-01-25    0.012431
2010-01-26    0.006139
2010-01-27    0.005763
2010-01-28   -0.017189
2010-01-29   -0.033607
2010-02-01    0.008161
2010-02-02    0.001760
2010-02-03    0.005973
2010-02-04   -0.027593
2010-02-05    0.006466
2010-02-08   -0.010707
2010-02-09    0.010462
2010-02-10   -0.000714
2010-02-11    0.004645
2010-02-12   -0.006757
2010-02-16    0.019784
                ...
2017-07-24   -0.002575
2017-07-25    0.008016
2017-07-26   -0.001887
2017-07-27   -0.012019
2017-07-28   -0.001640
2017-07-31   -0.004655
2017-08-01   -0.001650
2017-08-02   -0.004409
2017-08-03   -0.001522
2017-08-04    0.007346
2017-08-07   -0.003852
2017-08-08    0.005387
2017-08-09   -0.004396
2017-08-10   -0.014627
2017-08-11    0.015264
2017-08-14    0.015034
2017-08-15    0.000273
2017-08-16    0.005873
2017-08-17   -0.016972
2017-08-18    0.001243
2017-08-21   -0.004690
2017-08-22    0.013999
2017-08-23   -0.006014
2017-08-24   -0.000413
2017-08-25    0.001788
2017-08-28    0.000137
2017-08-29    0.003021
2017-08-30    0.013142
2017-08-31    0.010269
2017-09-01   -0.011101
Name: MSFT, Length: 1931, dtype: float64

#### 상관관계와 공분산 개념 이해

- [상관관계](http://ezstat.snu.ac.kr/textbook_sources/chapter_05.pdf)
- [공분산과 상관계수](http://carstart.tistory.com/132)
- [상관분석](http://carstart.tistory.com/111)
- [공분산(Covariance)이란 무엇인가?](http://blog.naver.com/PostView.nhn?blogId=jindog2929&logNo=10161293384)

In [131]:
# corr메서드는 NA가 아니고 정렬된 색인에서 연속하는 두 Series에 대해 상관관계를 계산한다.
returns.MSFT.corr(returns.IBM)

0.48300904568365077

In [132]:
# 공분산을 계산해주는 메서드.
returns.MSFT.cov(returns.IBM)

8.0518452845229079e-05

In [133]:
returns.corr()

           AAPL     GOOGL       IBM      MSFT
AAPL   1.000000  0.414752  0.367990  0.394345
GOOGL  0.414752  1.000000  0.393115  0.470330
IBM    0.367990  0.393115  1.000000  0.483009
MSFT   0.394345  0.470330  0.483009  1.000000

In [134]:
returns.cov()

           AAPL     GOOGL       IBM      MSFT
AAPL   0.000259  0.000102  0.000070  0.000090
GOOGL  0.000102  0.000233  0.000071  0.000101
IBM    0.000070  0.000071  0.000139  0.000081
MSFT   0.000090  0.000101  0.000081  0.000200

In [135]:
returns.corr?

In [136]:
returns.cov?

In [137]:
# 다른 Series나 DataFrame과의 상관관계를 계산해줌.
# Series를 넘기면 각 칼럼에 대해 계산한 상관관계를 담고 있는 Series를 반환해줌.
returns.corrwith(returns.IBM)

AAPL     0.367990
GOOGL    0.393115
IBM      1.000000
MSFT     0.483009
dtype: float64

In [138]:
# DataFrame을 넘기면 맞아 떨어지는 칼럼의 이름에 대한 상관관계를 계산해줌.
# 해당 코드는 시가 총액의 퍼센트 변화율에 대한 상관관계를 계산해보았다.
# axis=1 옵션을 넘기면 각 칼럼에 대한 상관관계와 공분산을 계산한다.
returns.corrwith(volume)

AAPL    -0.072689
GOOGL   -0.007801
IBM     -0.210648
MSFT    -0.090433
dtype: float64

### 5.3.2 유일 값, 값 세기, 멤버십

In [139]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [140]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [141]:
# Series에서 중복되는 값을 제거하고 유일값만 담고 있는 Series를 반환한다.
uniques = obj.unique()

In [142]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [143]:
# Series에서 도수를 계산하여 반환한다.
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [144]:
# 담고 있는 값으로 내림차순 정렬한다.
obj.value_counts(sort=False, ascending=False)

c    3
d    1
b    2
a    3
dtype: int64

In [145]:
obj.values

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [153]:
pd.value_counts(obj.values)

a    3
c    3
b    2
d    1
dtype: int64

In [154]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
b    2
a    3
dtype: int64

In [155]:
pd.value_counts(obj.values, sort=True)

a    3
c    3
b    2
d    1
dtype: int64

In [156]:
obj2 = Series(['c', 'c', 'd', 'd', 'c', 'd'])
pd.value_counts(obj2.values, sort=True)

c    3
d    3
dtype: int64

In [157]:
obj2 = Series(['d', 'c', 'c', 'd', 'c', 'd'])
pd.value_counts(obj2.values, sort=False)

c    3
d    3
dtype: int64

In [158]:
# 어떤 값이 Series에 있는지 나타내는 불리언 벡터를 반환해줌.
mask = obj.isin(['b', 'c'])

In [159]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [160]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

#### 유일 값, 값 세기, 버리기 메서드

메서드 | 설명
--- | ---
isin | Series의 각 원소가 넘겨받은 연속된 값에 속하는지를 나타내는 불리언 배열을 반환한다.
unique | Series에서 중복되는 값을 제거하고 유일한 값만 포함하는 배열을 반환한다. 결과는 Series에서 발견된 순서대로 반환된다.
value_counts | Series에서 유일 값에 대한 색인 값과 도수를 계산한다. 결과는 도수 값의 내림차순으로 정렬된다.

#### DataFrame의 여러 로우에 대해 히스토그램을 구해야 하는 경우

- DataFrame의 apply 함수에 pandas.value_counts를 넘기면 다음과 같은 결과를 얻을 수 있다.
- value_counts 메서드의 결과가 DataFrame의 칼럼 크기보다 작을 수 있기 때문에 fillna(0) 함수를 이용해서 비어있는 값은 0으로 채워준다.

#### 이게 도저히 이해가 안된다... 뭘 말하는거지..?? 왠 히스토그램을 구하나? -> 이해됐다. counts 세는거니까 히스토그램이지

- Qu1에 1이 1개 있고 2는 없고 3은 2개, 4도 2개
- Qu2에 1은 1개, 2가 2개, 3이 2개, 4가 0개
- Qu3에 1이 1개, 2가 1개, 4가 2개, 5가 1개

In [161]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

In [162]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [163]:
result = data.apply(pd.value_counts)

In [164]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [165]:
# value_counts 메서드의 결과가 DataFrame의 칼럼 크기보다 작을 수 있기 때문에
# fillna(0)함수로 비어있는 값은 0으로 채워준다.
result = data.apply(pd.value_counts).fillna(0)

In [166]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 5.4 누락된 데이터 처리하기

- 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 흔이 있는 일
- 누락 데이터를 가능한 쉽게 처리
- 모든 기술통계는 누락된 데이터를 배제하고 처리
- 누락된 데이터를 실수든 아니든 모두 NaN(Not a Number)으로 취급
- 누락된 값을 쉽게 찾을 수 있는 파수병 역할

In [167]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [168]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [169]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [170]:
# Python 내장 None 또한 null 취급함.
string_data[0] = None

In [171]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### NA 처리 메서드

인자 | 설명
--- | ---
dropna | 누락된 데이터가 있는 축(로우, 칼럼)을 제외시킨다. 어느 정도의 누락 데이터까지 용인할 것인지 지정할 수 있다.
fillna | 누락된 데이터를 대신할 값을 채우거나 'ffill' 또는 'bfill' 같은 보간 메서드를 적용한다.
isnull | 누락되거나 NA인 값을 알려주는 불리언 값이 저장된, 같은 형의 객체를 반환한다.
notnull | isnull과 반대되는 메서드다.

### 5.4.1 누락된 데이터 골라내기

In [172]:
from numpy import nan as NA

In [173]:
data = Series([1, NA, 3.5, NA, 7])

In [174]:
# dropna메서드는 실제 데이터가 들어있는 색인 값과 데이터를 Series값으로 반환한다.
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [175]:
# 불리언 색인을 이용 직접 계산.
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [176]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3]])

In [177]:
cleaned = data.dropna()

In [178]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [179]:
# NA가 하나라도 있으면 기본적으로 제외해서 보여줌
cleaned

     0    1    2
0  1.0  6.5  3.0

In [180]:
# how='all'옵션을 주면 모든 값이 NA인 로우만 제외시킴.
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [181]:
data.dropna?

Type:        instancemethod
String form:
<bound method DataFrame.dropna of    Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4>
File:        /Library/Python/2.7/site-packages/pandas-0.12.0_307_g3a2fe0b-py2.7-macosx-10.8-intel.egg/pandas/core/frame.py
Definition:  data.dropna(self, axis=0, how='any', thresh=None, subset=None)
Docstring:
Return object with labels on given axis omitted where alternately any
or all of the data are missing

Parameters
----------
axis : {0, 1}, or tuple/list thereof
    Pass tuple or list to drop on multiple axes
how : {'any', 'all'}
    any : if any NA values are present, drop that label
    all : if all values are NA, drop that label
thresh : int, default None
    int value : require that many non-NA values
subset : array-like
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include

Returns
-------
dropped : DataFrame

In [182]:
data[4] = NA

In [183]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [184]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [185]:
# axis=0는 로우를 나타낸다
data.dropna(axis=0, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [186]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [187]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [188]:
df = DataFrame(np.random.randn(7, 3))

In [189]:
df

          0         1         2
0  0.671601  0.250031 -0.840802
1  0.291448 -0.264640 -0.104363
2 -0.297847 -1.017525 -0.103098
3  0.104496 -1.102581 -0.331554
4 -0.986213 -0.873379  0.295478
5  1.397340 -0.037086 -0.805940
6 -0.374233 -1.763706 -1.651623

In [190]:
# ix는 slicing 마지막 문자까지 포함 됨
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

/home/ccnlml/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  from ipykernel import kernelapp as app

In [191]:
df

          0         1         2
0  0.671601       NaN       NaN
1  0.291448       NaN       NaN
2 -0.297847       NaN       NaN
3  0.104496       NaN -0.331554
4 -0.986213       NaN  0.295478
5  1.397340 -0.037086 -0.805940
6 -0.374233 -1.763706 -1.651623

In [192]:
# 몇 개 이상의 값이 들어있는 로우만 살펴보고 싶다면 thresh인자를 설정해주면 된다.
df.dropna(thresh=3)

          0         1         2
5  1.397340 -0.037086 -0.805940
6 -0.374233 -1.763706 -1.651623

In [193]:
df.dropna(thresh=2)

          0         1         2
3  0.104496       NaN -0.331554
4 -0.986213       NaN  0.295478
5  1.397340 -0.037086 -0.805940
6 -0.374233 -1.763706 -1.651623